Revit 2027 API
BuiltInFailures.CutFailures.CannotCutRoofError Property
 The roof couldn't be cut.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCutRoofError { get; }
Public Shared ReadOnly Property CannotCutRoofError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCutRoofError {
	FailureDefinitionId^ get ();
}
static member CannotCutRoofError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CutFailures Class
Autodesk.Revit.DB Namespace